# Rebar Crank Overridable Parameters Dispose Method

Source: https://www.revitapidocs.com/2026/87afb62f-49a2-ae80-5bb4-c58cfb8126b5.htm

---

| Rebar Crank Overridable Parameters Dispose Method |
| --- |

Releases all resources used by the RebarCrankOverridableParameters
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void Dispose()
```

```
Public Sub Dispose
```

```
public:
virtual void Dispose() sealed
```

```
abstract Dispose : unit -> unit
override Dispose : unit -> unit
```

#### Implements

IDisposable Dispose
See Also

#### Reference

RebarCrankOverridableParameters Class Autodesk.Revit.DB.Structure Namespace